package study;

public class For01 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/* 하나의 문장을 여러번 출력하는거!
		 * 문장이 하나가 반복할때는 단순for문 단순 for문에서는 블록을쓰지 않아도 괜찮다!
		 * 하지만 문장이 2개 이상일 경우에는 필요하다!!!!!
		 * ex_) for (int i= 0; i <5; i++)
		 * 			{system.out printf("안녕하세요"\n}
		 * 
		 *  처음 초기값은 한번만 읽는다! 그다음 조건 값을 읽는다..! 
		 * 그다음에 증감 그다음에 반복한다...! 조건에 맞지 않을때까지...!!!! 
		 * 그다음에는 루프를빠져나온다!  문장 하나일 경우에는 단순 for문 
		 */
		// 1부터 10까지의 합계 :55
		//변수선언
		int i ,sum =0;
		for (i=1;i<=10;i++) {
			sum=sum+i;
			System.out.println(i+"이면"+sum+"입니다");
		}
		/* 1이면1입니다
			2이면3입니다
			3이면6입니다
			4이면10입니다
			5이면15입니다
			6이면21입니다
			7이면28입니다
			8이면36입니다
			9이면45입니다
			10이면55입니다
		 */
		/*값이 제대로 들어가는지 안들어가는지에 대해서 알고 싶다면 디버그를 하면된다! 벌레같은거 오른쪽 창에 뜬다면 
		 *누르면 되고 안된다면  run에 debug as 에 누르고 들어가면 되고 마지막 출력문에 브레이크포인트를 걸고
		 *실행하는지 확인하면 된다 위에 빨간색 버튼이 종료하는거고 만약 실행되는지 확인하고 싶다면 F8번 누르면 된다.! 
		 *중지하고 오른쪽 위에 자바 버튼 누르면 돌아오고 브레이크 포인트를 두번 다시 클릭하면 없어진다! 신기한!점!!
		 *디버그 모드 종료하고 자바로 들어오는게 중요하다!!!
		 */
		/*for문
		 *  for (초기값; 조건식; 증감식)
		 *                    문장
		 * 블록을 잡아주어야 하나라고 인식한다!
		 * 중첩 for문 안쪽 for문과 바깥 쪽 for문을 이용한다...!
		 * for문안에 또 다른 for문이 있는 형태 
		 *                    
		 */
		
		
		
		
	}

}
