package study;

public class D001IF {

	public static void main(String[] args) {
		/*조건문!!! 상당히 중요!  가장 먼저 생각나는건 if 문
		 *  if 문
		 *  만약 ~이라면 / 조건이 참일때와 거짓일때의 각각 다른일을 수행
		 *  if (조건식) 실행할 문장 ; 조건은 항상 소괄호 안에서!
		 *  비교 판단을 할때는 순서도에서는 마름모로 표시! 
		 * 			 int a = 200;  if (a<100) 
		 * 			 system.out printf("100보다 작군요..\n") - 참이라면 수행
		 * 			 system.out printf("거짓이므로 안보이겠죠?\n") - 거짓이라면 수행
		 *	 만약 이것이 하나의 블록으로 묶여있다면 모두 수행하지 않음 왜냐면 다 거짓이니까!
		 *	 if else 문 
		 *	 if(조건문)실행할 문장 1; else 실행할 문장2;
		 *			int a= 200; 
		 *			if (a<100)
		 *			system.out printf("100보다 작군요..\n")
		 *			else - 조건이 거짓일때만 사용
		 *			system.out printf("100보다 크군요..\n")
		 *	중첩 if문 -if 문 안에 또 다른 if 문이 들어간다면 중첩 if문
		 *	 if (조건식1){if (조건식) 실행할 문장 1;
		 *		else 실행할 문장 2;}
		 *	else  실행할 문장3;
		 * 아무도 속하지 않는 구문은 else구문에 넣는다.
		 * 만약 중첩if보다 더 많다면 다중 if문이다. 
		 *  *정리*
		 *  단순if - 블럭이 없이 하나의 if문이 있는것!
		 *  중첩if - if문안에 if가 또있는것 조건의 조건을 만족한다 
		 *  ex) 합격은 평균 60인데 과목당 과락 40점 이상을 만족해야한다. 
		 *  다중if - 똑같은 위치에 else if라는 조건이 또 있는것! 조건이 여러개일때!
		 *  ex) 학점 판단할때 a>=90 b>=80 c>=70 그안에 포함되어있는게 아닌 조건이 여러개일때!
		 *  중괄호의 시작과 끝 판단 잘하기!
		 *  switch case문 
		 *  swith (정수값) { case 정수 값 1; 실행할 문장 1; break;
		 *  case 정수 값2 실행할 문장 2; break; 
		 *  case 정수 값3 실행할 문장 3; break; 
		 *  default - case 1.2.3 이 수행되지 않을때 수행한다. 
		 *   
		 */
	}

}
