package study;

public class S001 {

	public static void main(String[] args) {
		/*동적 바인딩 
		 * 업캐스팅과 다운캐스팅 
		 * 메소드의 매개변수를 부모타입으로 선언하면 훨씬 넓은 범위의 객체를 받을 수 있다. 
		 *  instance of 연산자 - 객체인지 아닌지를 구하는 것 /변수가 가르키는 객체의 실제타입을 알고 싶을때 사용 
		 *  value of 연산자 - 길이를 구하는 것
		 *  new  생성자 
		 *  종단 클래스와 종단 매소드 - 더이상 상속시킬 수 없는 것을 종단! final을 붙이면 그렇게 된다
		 *  종단클래스가 필요한 이유는 보안상의 이유 
		 *  종단클래스는 그 클래스안에서만 사용하면 된다.
		 *  enum - 열거형  /나열하는 것  인덱스로 처리 enum 자체가 상수 
		 *  다형성 
		 *  구성 - 클래스가 다른 클래스의 인스턴스를 클래스의 필드로 가지는 디자인 기법
		 *  상속 - 한 객체가 클래스를 상속받아서 부모객체의 속성과 동작을 획득할 수 있는 기법
		 */

	}

}
