package study;

class AAA{
	
}
// 클래스 메소드
public class S002 {

	public static void main(String[] args) {
		/* 객체지향 
		 * class가 여러개 그리고 메인이 있는 class가 실행되는거!
		 * public 접근 제한자 
		 *  같은 클래스 안에 클래스를 선언한다. 
		 *  메인클래스는 하나만 있어야 한다. 
		 *  클래스 명의 이름을 가진 클래스가 메인이다! 
		 *  접근할 수 있는 방법은 객체를 만들어서 이용하는 거 그거슨 바로 intstance
		 *  아니면 static 를 붙여서 객체를 만든다.
		 *  모든 클래스에는 하나의 생성자가 필요하다. 
		 *  클래스를 분리해서 활용한다. 
		 *  클래스 명의 첫글자는 대문자이다. 
		 *  속성은 멤버 변수이다. 메소드 행위..?
		 *  붕어빵을찍었다. 붕어빵을 찍는기계는 클래스 붕어빵은 인스턴스 또는 객체
		 *  생성자 함수는 반드시 한개는 존재한다...?!!
		 *  도트 연산자는 접근할때 사용한다. . 점말하는거얌
		 * 파라미터와 매개변수는 똑같은거얌
		 *  void는 반환값이 없다. 
		 *  그래서 여기에는 return 값이 필요하다. 
		 *  자바가 실행되면 main으로 간다. 
		 *  인스턴스는 객체! 
		 *  메소드는 호출 클래스는 접근 ?
		 *  클래스가 동일하면 에러...! 외부적으로 클래스이름이 동일하다면 에러!
		 *  하나의 패키지에서 클래스명이 중복이 되면 ! 패키지는 클래스를 넣어둔 곳..!
		 *   
		 */
		
	}

}
