package study;

public class S004 {

	public static void main(String[] args) {
		/* public
		 * public 접근제어 수식어는 외부에서 모든 클래스에서 접근이 가능하도록 하는 예약어
		 *  
		 * private 
		 * 자바 필드에 즉 변수에 직접 접근하지 못하도록 , 값을 변경하지 못하도록 접근제한자를 설정해놓는 것 
		 * 
		 * this는 클래스가 가지고 있는 필드값을 변경하기 위한 초기값을 지정해줄때 사용?
		 * 상속은 확장을 의미? 클래스 하나를 더 붙이면서 나의 영역을 확장
		 * 상속은 위에서 아래로 상속해주는 거를 슈퍼클래스 부모와 자녀를 구분하기위해서 쓰는 거는 super가 붙는건 부모?
		 * private 변수 앞에 
		 * public 필드 앞에 
		 * default
		 * protected 
		 * 생성자는 클래스 이름과 동일한 메소드를 말한다. 
		 * 생성자는 객체를 만들때 필요하다
		 *  생성자는 클래스 변수를 초기화 할때 쓰인다. 
		 *  생성자도 매서드의 일종이므로 
		 *  static 이 붙으면 클래스 변수 는 객체를 만들지 않아도 접근이 가능 만들어도됌
		 *  인스턴스 변수는 객체를 만들어야만 접근이 가능 
		 *  
		 */
	}

}
