package study;

public class S001 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/*향상된 for문
		배열과 컬렉션에 저장된 요소에 접근할때 기존보다 편리한 방법으로 처리할 수 있도록 for문의 새로운 문법이 추가 되었다.
		for(타입변수명 : 배열 또는 컬렉션){// 반복할 문장}
		위의 문장에서의 타입은 배열 또는 컬렉션 요소의 타입이어야 한다. 배열또는 컬렉션에 저장된 값이 매 반복마다 하나씩 
		순서대로 읽혀서 변수에 작성된다.
		그리고 반복문의 괄호{}내에서는 이변수를 사용해서 코드로 작성한다.
		향상된 for문이ㅏ 간결하다. 하지만 향상된 for문은 일반적인 for문과 달리 배열이나 컬렉션에 저장된 요소들을 읽어오는 
		용도로만 사용이 가능하다. 
		가변배열
		자바에서는 2차원 이상의 배열을 배열의 배열의 형태로 처리한다는 사실을 이용!
		보다 자유로운 형태의 배열을 구성할 수 있다. 2차원 이상의 다차원 배열을 생성할때 전체 배열 차수 중 
		마지막 차수의 길이를 지정하지 않고 추후에 각기 다른 길이의 배열을 생성함으로써 고정된 형태가 아닌
		보다 유동적인 가변배열을 구성할 수 있다. 
		int [][] score =new int [5][]; 이렇게 표시할 수 있다.
		 */
		
	}

}
