package study;
public class S001 {
	public static void main(String[] args) {
		/* 배열 - 여러개의 변수를 나란히 나열한 것
		 * 배열의 순서는 무조건 0부터이고 순차적이다! 
		 * array - 배열 index - 순서 
		 * 배열의 크기  0부터 n-1까지 순서는 무조건 0번부터!
		 * 배열은 []로 표시 배열은 데이터를 저장할 수 있는!
		 * 변수의 묶음/ 동일한 자료형에 한해서 변수를 묶는다.
		 *  데이터형 [] 배열이름 = new  데이터형 [갯수]; new새롭게 생성한다.
		 *  데이터형 배열이름[] = new 데이터형 [갯수]
		 *  데이터형[] 배열이름;(또는 데이터형 배열이름[];)
		 *  배열이름 = new [갯수];
		 *  왼쪽부터 순서가 정해진다.
		 *  [0] - 인덱스 번호,첨자 번호라고 한다! 인덱스의 크기를 나타냄! 인덱스와 크기를 헷갈리지 말자!!!!!
		 *  1차원배열은 행중심의 배열이다. 행과열의 만남 (행이 늘어난다.)2차원배열 - 행과열이 만나는 지점에 데이터가  들어간다(엑셀)
		 *  int aa[]={100,200,300,400}; 값을 먼저 지정해주어서 배열의 값을 나타낸 것도 있으니까! 
		 *  배열은 초기화 해주지 않아도 괜찮다. 자동으로 알아서 0으로 된다. (일단 int 형일때)
		 *  배열을 대입하려면 똑같은자료형에 똑같은 크기가 있어야한다.?
		 *  배열의 크기를 자동으로 잡아주는거! 배열 요소개수 = 배열이름.length; -자동으로 배열의 크기를 잡는다!
		 *  int aa[]= new int[4];의 배열의 크기 배열요소개수 = aa.length;
		 *  배열요소의 객수 aa. length -> int 형인 경우 aa.length(); -> String 인경우
		 */
	}

}
