package study;

public class S002 {

	public static void main(String[] args) {
		/*2차원배열의 개념 대괄호가 [][]  new  int [행][열] - 값이 아니고 데이터가 들어갈 수 있는 위치
		 * 여기서 중첩for문이 들어간다!  인덱스가 두개니까  변수를 2개잡아서!
		 * 2차원일때는 행과열의 곱으로 크기를 알 수 있다.
		 *  ppt 참조!  - 다양한 방법으로 나타낼 수 있다.
		 *  3차원 배열 - 면 , 행, 열로 이루어진다. ex 아파트 
		 *  int [][][] = new int[면][행][열]
		 *  데이터를 저장하기 위한 공간을 만드는 것 바로 배열!
		 *   가변 배열 - 막하기의 학점처리할때 사용하려고
		 *   aa[][] = new [3][];
		 *   aa[0][4]
		 *   aa[1][3]
		 *   aa[2][2] - 행이 바뀔때마다 열을 초기화 해주어야 한다.
		 *   행이 똑같을때 열이 달라지는 것 가변배열이라고 한다.
		 *   p 219 참고하기!
		 *   
		 */

	}

}
