package study;

public class S001 {

	public static void main(String[] args) {
	/* main 옆에 throws IOException 예외처리구문으로 throws 가 전가 해주는 거 
	 * 
	 * 추상클래스는 몸체가 없다? 
	 * 추상클래스는 상속에 의해서만 가능하다?
	 * 추상화는 구체적인 개념으로부터 공통된 부분들만 추려내어 일반화(구현한다)할 수 있도록 하는 것을 의미
	 * 일반적으로 사용할 수 있는 단계가 아닌 아직 미완성적인 개념 
	 * 
	 *  추상적인 작업을 하기 위해서는 먼저 추상매서드를 이해해야 한다. 
	 *  접근제한 abstract void [메서드 명]();
	 *  접근제한자는 생략가능하다!
	 *  매서드를 정의하면서 {} ->브레이스를 생략하여 매서드가 하는일 없이  ;으로 문장끝을 나타낸다.
	 *  
	 *  추상클래스는 반드시 상속이 이뤄져야 한다.
	 *  
	 *  인터페이스는 접근제한자가 무조건 public 이다.
	 *  interface는 구현이라는 의미가 있는데 이것은 implements 이다. 
	 *  [접근제한]interfaces [interface명]{} 
	 *  인터페이스는 다중상속이 가능하다 
	 *  클래스와 클래스 
	 *  클래스와 인터페이스
	 *  인터페이스와 인터페이스
	 * 	 간의 구분 하기 
	 * 
	 * 열거형 
	 * enum  상수를 하나의 객체로 인식하고 여러개의 상수 객체들을 한 곳에 모아둔 하나의 묶음(객체)
	 * java.lang에 있다. 
	 * 
	 * instance of 객체인지 아닌지 비교 하는 것 object와 비교 
	 * 
	 * 내부클래스 - 특정 클래스내에 또 다른 클래스가 정의되는 것을 의미 
	 * 보안성이 좋아진다 - 외부의 클래스만 보이기때문에 
	 */
	}

}
